
public class Ex02 {

	public static void main(String[] args) {  // 얘도 메소드네
		
	}
	
	
	
//	메소드 method
//	public static int add(int a, int b) {
// 	   1      2    3   4        5          	
//		return a+b;
//		   6    7
		
//		1. 접근 제한자 : public, default, protected, private
//		2. 메모리 할당 위치 : 나중에는 안 붙인다
//		3. 리턴 타입 : 리턴할 데이터타입. 아무것도 리턴하고 싶지 않으면 void
//		4. 메소드 이름 : 변수명 규칙과 같다. 특수문자는 $ _ 만 된다. 이름은 겹쳐도 되는데 아직은 몰라도 된다
//		5. 매개변수 : 구분할 때 , 로 구분. 반드시 자료형을 앞에 붙여야 한다. 개수와 자료형의 종류는 뭐든 괜찮다
//		6. 리턴 키워드 : 메소드는 리턴 키워드를 만나면 즉시 메소드를 사용한 곳(메소드 호출한 곳)으로 돌아간다. 
//		7. 리턴 값 : 변수, 연산자 다 가능하다.
	
		
	
//	메소드의 장점
//	- 코드 중복 최소화
//	- 읽기 편해지고 빠르게 수정할 수 있음
	
	
	
		
		
	
}
